Repository: yt-dlg/yt-dlg
Catalog: youtube_dl_gui/locale/*/LC_MESSAGES/youtube_dl_gui.po
Languages: ar_sa

source: Title
ar_sa: العنوان

source: Title + ID
ar_sa: العنوان + ID

source: Title + Quality
ar_sa: العنوان + الجودة

source: Title + ID + Quality
ar_sa: العنوان + ID + الجودة

source: Custom
ar_sa: مخصص

source: default
ar_sa: افتراضي (دون تعديل)

source: Enter URLs below
ar_sa: ضع الرابط هنا

source: Update
ar_sa: تحديث

source: Options
ar_sa: الخيارات

source: Stop
ar_sa: إيقاف

source: Info
ar_sa: معلومات

source: Welcome
ar_sa: مرحباً

source: Warning
ar_sa: تحذير

source: Add
ar_sa: إضافة

source: Download list
ar_sa: قائمة التنزيلات

source: Delete
ar_sa: حذف

source: Play
ar_sa: تشغيل

source: Up
ar_sa: فوق

source: Down
ar_sa: اسفل

source: Reload
ar_sa: أعد التحميل

source: Pause
ar_sa: توقيف مؤقت

source: Start
ar_sa: إبدأ

source: About
ar_sa: عن

source: View Log
ar_sa: شاهد السِجِل

source: Downloads completed
ar_sa: اكتمال التنزيلات

source: Total Progress: {0:.1f}% | Queued ({1}) Paused ({2}) Active ({3}) Completed ({4}) Error ({5})
ar_sa: مجموع العمليات : {0:.1f}% | في الانتظار ({1}) موقف مؤقتا ({2}) نشط ({3}) اكتملت ({4}) أخطاء ({5})

source: Stopping downloads
ar_sa: إيقاف التنزيل

source: Downloads stopped
ar_sa: تم إيقاف التنزيل

source: You need to provide at least one URL
ar_sa: يجب ان تضع رابطا واحدا على الاقل

source: Downloads started
ar_sa: بدأ التنزيل

source: Choose Directory
ar_sa: اختر مكان الحفظ

source: Download in progress. Please wait for all downloads to complete
ar_sa: جاري التنزيل . انتظر حتى تكتمل التنزيلات

source: Update already in progress
ar_sa: جاري التحديث

source: Unable to open directory: '{dir}'. The specified path does not exist
ar_sa: فعل لفتح الدليل : '{dir}'. المسار غير موجود

source: Error while shutting down. Make sure you typed the correct password
ar_sa: تعذر إيقاف الجهاز . تأكد من كلمة المرور

source: Shutting down system
ar_sa: إيقاف تشغيل النظام

source: Extension
ar_sa: نوع الملف (الصيغة)

source: Size
ar_sa: الحجم

source: Percent
ar_sa: النِسبة المئوية

source: ETA
ar_sa: الوقت المتبقي

source: Speed
ar_sa: سرعة التنزيل

source: Status
ar_sa: الحالة

source: Get URL
ar_sa: جد الرابط

source: Get command
ar_sa: الحصول على أمر

source: Open destination
ar_sa: افتح وجهة

source: Re-enter
ar_sa: اعادة الادخال

source: Resume
ar_sa: استئتاف

source: Video
ar_sa: الفيديو

source: Audio
ar_sa: الصوتي

source: Remove all
ar_sa: حذف الكل

source: Remove completed
ar_sa: حذف المكتمل

source: No items selected. Please pick an action
ar_sa: لم يتم تحديد أي عنصر. يرجى اختيار إجراء

source: Are you sure you want to remove selected items?
ar_sa: هل انت متأكد من حذف هذا العنصر ؟

source: Item is active, cannot remove
ar_sa: لا يمكن الحذف الآن

source: Item is not completed
ar_sa: لم يكتمل العنصر بعد

source: Update in progress. Please wait for the update to complete
ar_sa: قيد التحديث .يرجى الانتظار

source: Logging is disabled
ar_sa: تم تعطيل التسجيل

source: Shutdown
ar_sa: إيقاف التشغيل

source: Shutting down in {0} second(s)
ar_sa: إيقاف التشغيل في {0} ثانية(s)

source: No items to download
ar_sa: لا توجد عناصر للتنزيل

source: Are you sure you want to exit?
ar_sa: هل تريد الخروج من البرنامج ؟

source: Exit
ar_sa: خروج

source: Reset
ar_sa: إسترجاع الإعدادات الافتراضية

source: Close
ar_sa: إنهاء

source: General
ar_sa: عام

source: Formats
ar_sa: الصيغ

source: Downloads
ar_sa: التنزيلات

source: Advanced
ar_sa: متقدم

source: Extra
ar_sa: إضافي

source: German
ar_sa: الالمانية

source: English
ar_sa: الانجليزية

source: French
ar_sa: الفرنسية

source: Italian
ar_sa: الايطالية

source: Portuguese
ar_sa: البرتغالية

source: Russian
ar_sa: الروسية

source: Spanish
ar_sa: الاسبانية

source: Language
ar_sa: اللغة

source: Filename format
ar_sa: اسم الملف الصيغة

source: Filename options
ar_sa: اسم الملف خيارات

source: Restrict filenames to ASCII
ar_sa: قيّد اسم الملف الى ASCII

source: More options
ar_sa: مزيد من الخيارات

source: Confirm on exit
ar_sa: التأكيد عند الإنهاء

source: Confirm item deletion
ar_sa: التأكيد عند حذف عنصر

source: Inform me on download completion
ar_sa: نبهني عند انتهاء التنزيلات

source: Shutdown on download completion
ar_sa: اوقف التشغيل عند انتهاء التنزيلات

source: SUDO password
ar_sa: كلمة مرور المسؤول

source: In order for the changes to take effect please restart {0}
ar_sa: تطبق التغييرات بعد اعادة التشغيل {0}

source: Restart
ar_sa: إعادة التشغيل

source: high
ar_sa: عالي

source: mid
ar_sa: متوسط

source: low
ar_sa: منخفض

source: Video formats
ar_sa: صيغ الفيديو

source: Audio formats
ar_sa: صيغ الصوت

source: Post-Process options
ar_sa: خيارات مابعد العملية

source: Keep original files
ar_sa: احتفظ بالملفات الأصلية

source: Extract audio from video file
ar_sa: استخرج ملف صوتي من ملف الفيديو

source: Embed thumbnail in audio file
ar_sa: تضمين الصورة المصغرة في الملف الصوتي

source: Add metadata to file
ar_sa: أضف بيانات وصفية للملف

source: Audio quality
ar_sa: جودة الصوت

source: Greek
ar_sa: اليونانية

source: Hebrew
ar_sa: العبرية

source: Swedish
ar_sa: السويدية

source: Turkish
ar_sa: التركية

source: None
ar_sa: لاشيء

source: Automatic subtitles (YOUTUBE ONLY)
ar_sa: الترجمة التلقائية (YOUTUBE ONLY)

source: All available subtitles
ar_sa: كل الترجمات المتوفرة

source: Subtitles by language
ar_sa: الترجمات حسب اللغة

source: Subtitles
ar_sa: الترجمات

source: Subtitles options
ar_sa: خيارات الترجمة

source: Embed subtitles into video file (mp4 ONLY)
ar_sa: تضمين ترجمات مصاحبة مع ملف الفيديو (mp4 فقط)

source: Playlist
ar_sa: قائمة التشغيل

source: Max
ar_sa: اقصى

source: Filesize
ar_sa: حجم الملف

source: Min
ar_sa: اقل

source: Retries
ar_sa: فحص

source: Authentication
ar_sa: إستيثاق

source: Username
ar_sa: اسم المستخدم

source: Password
ar_sa: كلمة المرور

source: Video password
ar_sa: كلمة المرور الخاصة بالفيديو

source: Network
ar_sa: الشبكة

source: Proxy
ar_sa: الخادم الوكيل (البروكسي)

source: User agent
ar_sa: مستخدم وكيل

source: Referer
ar_sa: يدل

source: Logging
ar_sa: تسجيل

source: Enable log
ar_sa: تفعيل السجّل

source: View
ar_sa: عرض

source: Clear
ar_sa: مسح

source: Extra options
ar_sa: خيارات إضافية

source: Ignore errors
ar_sa: تجاهل الأخطاء

source: Prefer native HLS
ar_sa: الأصلي HLS تفضيل

source: Cancel
ar_sa: إلغاء

source: OK
ar_sa: موافق

source: Log Viewer
ar_sa: عارض السجل
